emb4fun/tinytap/firmware/common/library/tal_frdmn947/cpu/nxp/mcxnx4x/sdk/middleware/sdmmc/host/usdhc/non_blocking/fsl_sdmmc_host.c
    host->cacheAlignBuffer     = cacheAlignBuffer;
    host->cacheAlignBufferSize = cacheAlignBufferSize;
}
#endif
#endif

status_t SDMMCHOST_TransferFunction(sdmmchost_t *host, sdmmchost_transfer_t *content)
{
    status_t error = kStatus_Success;
    uint32_t event = 0U;
    usdhc_adma_config_t dmaConfig;

#if defined SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER && SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER
    usdhc_scatter_gather_data_list_t sgDataList0;
    usdhc_scatter_gather_data_list_t sgDataList1;
    usdhc_scatter_gather_data_t scatterGatherData;
    uint32_t unAlignSize                     = 0U;
    usdhc_scatter_gather_transfer_t transfer = {.data = NULL, .command = content->command};
#endif

    (void)SDMMC_OSAMutexLock(&host->lock, osaWaitForever_c);

    if (content->data != NULL)
    {
        (void)memset(&dmaConfig, 0, sizeof(usdhc_adma_config_t));
        /* config adma */
        dmaConfig.dmaMode = SDMMCHOST_DMA_MODE;
#if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        dmaConfig.burstLen = kUSDHC_EnBurstLenForINCR;
#endif
        dmaConfig.admaTable      = host->dmaDesBuffer;
        dmaConfig.admaTableWords = host->dmaDesBufferWordsNum;

#if defined SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER && SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER
#if ((defined __DCACHE_PRESENT) && __DCACHE_PRESENT) || (defined FSL_FEATURE_HAS_L1CACHE && FSL_FEATURE_HAS_L1CACHE)
        if ((host->cacheAlignBuffer == NULL) || ((host->cacheAlignBufferSize == 0U)))
        {
            /* application should register cache line size align buffer for host driver maintain the unalign data
             * transfer */
            assert(false);
            return kStatus_InvalidArgument;
        }
#endif
        scatterGatherData.enableAutoCommand12 = content->data->enableAutoCommand12;
        scatterGatherData.enableAutoCommand23 = content->data->enableAutoCommand23;
        scatterGatherData.enableIgnoreError   = content->data->enableIgnoreError;
        scatterGatherData.dataType            = content->data->dataType;
        scatterGatherData.blockSize           = content->data->blockSize;

        transfer.data = &scatterGatherData;

        if (content->data->rxData != NULL)
        {
            scatterGatherData.sgData.dataAddr = content->data->rxData;
            scatterGatherData.dataDirection   = kUSDHC_TransferDirectionReceive;
        }
        else
        {
            scatterGatherData.sgData.dataAddr = (uint32_t *)content->data->txData;
            scatterGatherData.dataDirection   = kUSDHC_TransferDirectionSend;
        }
        scatterGatherData.sgData.dataSize = content->data->blockSize * content->data->blockCount;
        scatterGatherData.sgData.dataList = NULL;

        /*
         * If the receive transfer buffer address is not cache line size align, such as
         *---------------------------------------------------------------------
         *|  unalign head region|      align region     |   unaling tail region|
         *---------------------------------------------------------------------
         *
         * Then host driver will splict it into three scatter gather transfers,
         * 1. host->cacheAlignBuffer will be used as first scatter gather data address, the data size is the unalign
         *head region size.
         * 2. align region start address will be used as second scatter gather data address, the data size is the align
         *region size.
         * 3. (uint32_t *)((uint32_t)host->cacheAlignBuffer + SDMMC_DATA_BUFFER_ALIGN_CACHE)
         *    will be used as third scatter gather data address, the data size is the unaling tail region size.
         *
         * Once scatter gather transfer done,
         * 1. host driver will invalidate the cache for the data buffer in the scatter gather transfer list
         * 2. host driver will copy data from host->cacheAlignBuffer to unalign head region
         * 3. host driver will copy data from (uint32_t *)((uint32_t)host->cacheAlignBuffer +
         *SDMMC_DATA_BUFFER_ALIGN_CACHE) to unalign tail region
         *
         * At last, cache line unalign transfer done
         */
        if ((content->data->rxData != NULL) &&
            (((uint32_t)content->data->rxData % SDMMC_DATA_BUFFER_ALIGN_CACHE) != 0U))
        {
            unAlignSize          = ((uint32_t)content->data->rxData -
                           (((uint32_t)content->data->rxData) & (~(SDMMC_DATA_BUFFER_ALIGN_CACHE - 1))));
            sgDataList1.dataSize = unAlignSize;
            unAlignSize          = SDMMC_DATA_BUFFER_ALIGN_CACHE - unAlignSize;

#if ((defined __DCACHE_PRESENT) && __DCACHE_PRESENT) || (defined FSL_FEATURE_HAS_L1CACHE && FSL_FEATURE_HAS_L1CACHE)
            scatterGatherData.sgData.dataAddr = host->cacheAlignBuffer;
#endif
            scatterGatherData.sgData.dataSize = unAlignSize;
            scatterGatherData.sgData.dataList = &sgDataList0;

            sgDataList0.dataAddr =
                (void *)((((uint32_t)content->data->rxData) & (~(SDMMC_DATA_BUFFER_ALIGN_CACHE - 1))) +
                         SDMMC_DATA_BUFFER_ALIGN_CACHE);
            sgDataList0.dataSize = content->data->blockCount * content->data->blockSize - SDMMC_DATA_BUFFER_ALIGN_CACHE;
            sgDataList0.dataList = &sgDataList1;
#if ((defined __DCACHE_PRESENT) && __DCACHE_PRESENT) || (defined FSL_FEATURE_HAS_L1CACHE && FSL_FEATURE_HAS_L1CACHE)
            sgDataList1.dataAddr = (uint32_t *)((uint32_t)host->cacheAlignBuffer + SDMMC_DATA_BUFFER_ALIGN_CACHE);
#endif
            sgDataList1.dataList = NULL;
        }
#endif

#if ((defined __DCACHE_PRESENT) && __DCACHE_PRESENT) || (defined FSL_FEATURE_HAS_L1CACHE && FSL_FEATURE_HAS_L1CACHE)
#if !(defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL)
        if (host->enableCacheControl == kSDMMCHOST_CacheControlRWBuffer)
        {
            /* no matter read or write transfer, clean the cache line anyway to avoid data miss */
            DCACHE_CleanByRange(
                (uint32_t)(content->data->txData == NULL ? content->data->rxData : content->data->txData),
                (content->data->blockSize) * (content->data->blockCount));
        }
#endif
#endif
    }

    /* clear redundant transfer event flag */
    (void)SDMMC_OSAEventClear(&(host->hostEvent), SDMMCHOST_TRANSFER_CMD_EVENT);

#if defined SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER && SDMMCHOST_ENABLE_CACHE_LINE_ALIGN_TRANSFER
    error = USDHC_TransferScatterGatherADMANonBlocking(host->hostController.base, &host->handle, &dmaConfig, &transfer);
#else
    error = USDHC_TransferNonBlocking(host->hostController.base, &host->handle, &dmaConfig, content);
#endif

    if (error == kStatus_Success)
    {
        /* wait command event */
        if ((kStatus_Fail == SDMMC_OSAEventWait(&(host->hostEvent), SDMMCHOST_TRANSFER_CMD_EVENT,
                                                SDMMCHOST_TRANSFER_COMPLETE_TIMEOUT, &event)) ||
            ((event & SDMMC_OSA_EVENT_TRANSFER_CMD_FAIL) != 0U))
        {
            error = kStatus_Fail;
        }
        else
        {
            if (content->data != NULL)
            {
                if ((event & SDMMC_OSA_EVENT_TRANSFER_DATA_SUCCESS) == 0U)
                {
                    if (((event & SDMMC_OSA_EVENT_TRANSFER_DATA_FAIL) != 0U) ||
                        (kStatus_Fail == SDMMC_OSAEventWait(&(host->hostEvent), SDMMCHOST_TRANSFER_DATA_EVENT,
                                                            SDMMCHOST_TRANSFER_COMPLETE_TIMEOUT, &event) ||
                         ((event & SDMMC_OSA_EVENT_TRANSFER_DATA_FAIL) != 0U)))
                    {
                        error = kStatus_Fail;
                    }
                }
            }
        }
    }

